START_MESSAGE = (
    'Добрага ранку, БМСУ-4\n'
    'вас вітае бот-дапаможнік Зміцера\n\n'
    'даступныя каманды:\n'
    '/func - пачаць вылічэнне ўзроўню\n'
    '/cancel - скасаваць бягучае вылічэнне\n'
    '/language - поменять язык на русский, если так непонятно'
)

FUNC_START = 'увядзіце ўзровень рэпера:'
FUNC_ASK_B = 'увядзіце адлік па рэйцы (над рэперам):'
FUNC_ASK_Y = 'увядзіце адлік па рэйцы (над вымяраемай плоскасцю):'
REPEAT_NO_STATE = "узровень рэпера і адлік па рэйцы не ўведзены, пачніце з /func"

FUNC_ERROR_NUMBERS = (
    'памылка! усе аргументы павінны быць лікамі.\n '
    'паспрабуйце яшчэ раз або скарыстайцеся /cancel для адмены'
)

FUNC_SUCCESS = 'вынік: {a} + {b} - {y} = {result}\n\n(для пералічэння ўзроўню с тымі жа ўзроўням рэпера і адлікам па рэйцы, скарыстайцеся камандай /repeat)'

FUNC_GENERAL_ERROR = 'адбылася памылка падчас вылічэння.'

FUNC_CANCELLED = 'вылічэнне скасавана. скарыстайцеся /func для новага вылічэння.'

COMMAND_DESCRIPTIONS = [
    ("start", "пачаць працу з ботам"),
    ("func", "пачаць вылічэнне ўзроўню"),
    ("repeat", "увесці новы адлік па рэйцы (над вымяраемай плоскасцю)"),
    ("language", "змяніць мову / сменить язык"),
    ("cancel", "скасаваць вылічэнне")
]

BOT_STARTED = "бот запушчаны..."
TOKEN_NOT_FOUND = "не знойдзены токен бота! стварыце файл .env з TELEGRAM_BOT_TOKEN=ваш_токен"
FUNC_ERROR_LOG = "памылка ў камандзе func: {}"


